# RoomTagNotInRoom Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RoomFailures..::..RoomTagNotInRoom Property
BuiltInFailures..::..RoomFailures Class See Also
---
[Room] Tag is outside of its [Room]. Enable Leader or move [Room] Tag within its [Room].
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RoomTagNotInRoom { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoomTagNotInRoom As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RoomTagNotInRoom {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RoomFailures Class
Autodesk.Revit.DB Namespace